Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: །དེ་ནས་ཀུན་ཏུ་རྒྱུ་ཉེ་རྒྱལ་དང་། པང་ནས་སྐྱེས་གཡོག་ལྔ་བརྒྱ་དང་བཅས་པ་བཅོམ་ལྡན་འདས་ལས་རབ་ཏུ་འབྱུང་བར་ཆས་པར་བདུད་སྡིག་ཅན་གྱིས་རིག་ནས་ཅི་ནས་དེ་གཉིས་དགེ་སྦྱོང་གཽ་ཏ་མའི་གན་དུ་འགྲོ་མི་ནུས་པར་བྱ་བའི་ཕྱིར་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོའི་ཕྱི་ལོགས་སུ་གཡང་ས་ཆེན་པོ་ཟབས་སུ་དཔག་ཚད་བརྒྱ་པ་ཞིག་སྤྲུལ་ཏོ།
en: The two wandering mendicants Upatiṣya and Kaulita, together with their retinue of five hundred, then set out to go forth under the Blessed One. Māra, the evil one, knew this, and so he conjured up a huge chasm outside of the great city of Rājagṛha one hundred leagues deep so that the two would be unable to go before Gautama the monk.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་འདི་འདྲ་བའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུ་མཛད་དེ། ཅི་ནས་ཀུན་ཏུ་རྒྱུ་ཉེ་རྒྱལ་དང་། པང་ནས་སྐྱེས་གཉིས་གཡང་ས་ཆེན་པོ་དེ་མི་མཐོང་ཞིང་ལམ་དྲང་པོར་འགྲོ་བར་མཛད་དོ།
en: The Blessed One, however, performed a miraculous feat whereby the wandering mendicants Upatiṣya and Kaulita did not see that great chasm and could travel by the most direct route.

source: །ཡང་བདུད་སྡིག་ཅན་གྱིས་དེ་གཉིས་ཀྱི་མདུན་དུ་རི་ཆེན་པོ་བརྟན་པ། སྲ་བ། མ་རྙིལ་བ། སུལ་མེད་པ། གཅིག་ཏུ་སྟུག་པོར་གྱུར་པ།
en: Māra , the evil one, further conjured a mountain range in front of them—stable, solid, unbreakable, without valleys, singularly thick, hard, and one thousand leagues tall.

source: མཁྲེགས་པ། འཕང་དུ་དཔག་ཚད་སྟོང་ཡོད་པ་ཅིག་མངོན་པར་སྤྲུལ་ཏེ། སེང་གེ་ཁྲོ་ཞིང་གདུག་ལ་གཏུམ་པ། སྒྲ་ཆེན་པོ་འབྱིན་པ་སྟོང་ཡང་མངོན་པར་སྤྲུལ་ན། བཅོམ་ལྡན་འདས་ཀྱིས་གཟི་བརྗིད་དང་རྫུ་འཕྲུལ་གྱི་མཐུས་སྐྱེས་བུ་དམ་པ་དེ་གཉིས་ཀྱིས་རི་དེ་ཡང་མ་མཐོང་།
en: In addition, he conjured one thousand fierce lions, vicious and terrible, making a great din. But the two good men, thanks to the force of the Blessed One’s splendor and miraculous powers, did not see that mountain.

source: སེང་གེ་ཡང་མ་མཐོང་། སེང་གེའི་སྐད་ཀྱང་མ་ཐོས་ཏེ་ལམ་དྲང་པོར་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་སོང་ངོ་།
en: Nor did they see the lions or hear their roaring. Instead, they arrived where the Blessed One was by the straightest possible route.

source: །བཅོམ་ལྡན་འདས་ནི་འཁོར་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ནས་ཆོས་སྟོན་ཏེ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཁྱེད་སྐྱེས་བུ་དམ་པ་ཚོགས་ཀྱི་གཙོ་བོ་གཡོག་གི་ཚོགས་ཅན་འདི་གཉིས་ལ་ལྟོས།
en: The Blessed One, attended upon by a congregation of many hundreds of thousands of followers, was expounding the Dharma. “Look, O monks, at these two good men, surrounded by followers, who are the heads of their assembly!”

source: དེ་དག་གིས་གསོལ་པ། བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ།
en: “We see them, O Blessed One,” they replied.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྐྱེས་བུ་དམ་པ་འདི་གཉིས་གཡོག་དང་བཅས་པ་ངའི་ཐད་དུ་རབ་ཏུ་བྱུང་ནས་གཅིག་ནི་ངའི་ཉན་ཐོས་ཐམས་ཅད་ཀྱི་ནང་ན་ཤེས་རབ་ཅན་གྱི་མཆོག་ཏུ་འགྱུར་རོ། །གཅིག་ནི་རྫུ་འཕྲུལ་ཅན་གྱི་མཆོག་ཏུ་འགྱུར་རོ།
en: The Blessed One foresaw, “Of these two good men who are here, along with their retinues, to enter the wandering mendicant’s life by my side, one will become the best of those endowed with insight among all the hearers, and the other will become the best of those endowed with miraculous powers.”

source: །དེ་ནས་དགེ་སློང་ཞིག་གིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ།
en: One of the monks recited on that occasion the following stanza:

source: །སྐྱེས་བུ་མཁས་པ་གཡོག་ལྡན་འདི་གཉིས་ནི།
en: “These two learned men, along with their retinues, Are prophesied to be benefited by the best of men

source: །རྫུ་འཕྲུལ་ལྡན་དང་ཤེས་རབ་འཇིགས་མེད་པར། །མི་མཆོག་ཕན་པ་མཛད་པས་ལུང་བསྟན་ཏེ།
en: And to acquire miraculous powers and fearless insight.

source: །བདག་གིས་དེ་གཉིས་བསྟི་སྟང་བསྐྱེད་ནས་བསུ།
en: I welcome them both with a feeling of growing admiration.”

source: །དེ་ནས་དགེ་སློང་དེ་སྟན་ལས་ལངས་ནས་དགེ་སློང་མང་པོ་དང་། ཁྱིམ་ན་གནས་པ་དང་། རབ་ཏུ་བྱུང་བ་མང་པོ་དང་ལྷན་ཅིག་ཏུ་སྐྱེས་བུ་དམ་པ་དེ་གཉིས་བསུ་ནས་བསྙེན་བཀུར་བྱས་སོ།
en: The monk then got up from his seat and, together with many other monks, householders, and wandering mendicants, welcomed the two good men and honored them.

source: །དེ་ནས་སྐྱེས་བུ་དམ་པ་དེ་གཉིས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་སྟེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རབ་ཏུ་འབྱུང་བ་དང་། བསྙེན་པར་རྫོགས་པ་དགེ་སློང་གི་དངོས་པོ་བདག་ཅག་གཉིས་ལ་སྩལ་དུ་གསོལ།
en: The two men, for their part, moved near to the Blessed One, bowed their heads to his feet, circumambulated him clockwise three times, and, standing before him, said, “Please allow us to go forth and bestow the monk’s ordination upon us.

source: བདག་ཅག་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ།
en: Close to you, let us practice celibacy.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱེད་གཉིས་ཀྱི་མིང་ཅི།
en: “What are your names, O noble sons?” asked the Blessed One.

source: ཉེ་རྒྱལ་གྱིས་གསོལ་པ། བདག་ནི་བྲམ་ཟེ་རྒྱལ་གྱི་བུ་ལགས་ཏེ་ཉེ་རྒྱལ་ཞེས་བགྱི། བདག་གི་མའི་མིང་ནི་ཤཱ་རི་ཀ་སྟེ།
en: Upatiṣya replied, “I am the son of the brahmin Tiṣya, and so I am called Upatiṣya. My mother’s name is Śārikā.

source: བདག་དེ་ལས་སྐྱེས་པས་ན་དེའི་སླད་དུ་བདག་གི་མིང་ནི་ཤཱ་རིའི་བུ་ཞེས་བཏགས་སོ། །བདག་རབ་ཏུ་འབྱུང་བར་ཡང་ཕ་མས་གནང་ལགས་སོ། །པང་ནས་སྐྱེས་ཀྱིས་གསོལ་པ།
en: As I was born of her, my given name is Śāriputra. I already have my parents’ permission to go forth.”

source: བདག་གི་ཕའི་མིང་ནི་ཀཽཎྜི་ནྱ་ཞེས་བགྱི།
en: Kaulita replied, “My father’s name is Kauṇḍinya, and so I am called Kaulita.

source: བདག་གི་མའི་མིང་ནི་མཽད་གལ་ཞེས་བགྱི་སྟེ།
en: My mother’s name is Mudgalā, so the common name given to me is Maudgalyāyana.

source: བདག་དེ་ལས་སྐྱེས་པས་ན་དེའི་སླད་དུ་བདག་གི་མིང་ནི་མཽད་གལ་གྱི་བུ་ཞེས་བཏགས་སོ། །བདག་རབ་ཏུ་འབྱུང་བར་ཡང་ཕ་མས་གནང་ལགས་སོ།
en: Some people know me as Kaulita, while others as Maudgalyāyana. I already have my parents’ permission to go forth.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་ངའི་ཐད་དུ་གཡོག་དང་བཅས་ཏེ།
en: “Śāriputra, Maudgalyāyana, and your retinues, you may live the holy life by my side,” said the Blessed One.

source: ཚངས་པར་སྤྱད་པ་སྤྱོད་ཅིག་ཅེས་བཀའ་སྩལ་པ་དང་། དེ་ཉིད་ཀྱིས་དེ་གཉིས་རབ་ཏུ་བྱུང་བ་དང་། བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོར་གྱུར་ཏོ།
en: This is how they went forth and received their ordination as monks.

source: །ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་གཡོག་དང་བཅས་པ་རབ་ཏུ་བྱུང་ནས་རིང་པོ་མ་ལོན་པར་བདུད་སྡིག་ཅན་དབང་ཕྱུག་ཆེན་པོའི་གཟུགས་སུ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Not long after Śāriputra, Maudgalyāyana, and their retinues had gone forth, Māra , the evil one, assuming the form of Maheśvara, stood in front of the Blessed One and said:

source: །གང་དག་བསྟན་བཅོས་དོན་སྤྱོད་མཁས་པ་རིག་པའི་ཕ་རོལ་སོང་།
en: “Those who convey the meaning of systematic treatises and who have excelled in the fields of knowledge

source: །དེ་ཀུན་ང་ཡི་རྐང་ལ་ཕྱག་འཚལ་དེ་དག་འདྲེན་པ་ང་།
en: Will all bow to my feet, as I am their guide.

source: །གཽ་ཏམ་སློབ་མ་འཁོར་བཅས་ང་ལ་དེང་མྱུར་སྐྱབས་འཚོལ་ཅིག །མྱ་ངན་འདས་འགྲོ་རྒྱས་པ་གསལ་བའི་ལམ་ནི་ཁྱེད་ལ་བཤད།
en: You, Venerable Gautama, with your following of students, should promptly seek refuge in me today. I will teach you the wide and clear path to nirvāṇa.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied:

source: ཁྱོད་ལམ་འགྲོ་བ་འདི་དག་ངན་འགྲོར་འདྲེན་ཅིང་སྡུག་བསྔལ་རྒྱ་མཚོ་རྙེད་པར་བྱེད།
en: “Your path brings misfortune to beings and leads them to the ocean of suffering.

source: །ང་ཡི་ལམ་ནི་རྒྱུ་དང་མི་རྒྱུ་འགྲོ་བའི་སྡུག་བསྔལ་རྒྱ་མཚོ་སྐེམས་བྱེད་པ།
en: My path dries up the ocean of suffering for both mobile and stationary beings.

source: །འཆལ་པ་འཛེམ་པ་མེད་ཅིང་མུ་ཅོར་སྨྲ་བ་ཝ་སྐད་ད་ཡང་ཅི་ཞིག་ཟེར།
en: What more then will you say, O arrogant and garrulous one with the voice of a jackal? You are exposed!

source: །ཁྱོད་ནི་བཅོམ་ཟིན་བདུད་ཀྱི་ལས་ཀྱིས་ང་ལ་ད་ཡང་འདིར་ནི་བྱེད་མི་ནུས།
en: It is not in your power to play Māra ’s tricks on me again.”

source: །དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་དབང་ཕྱུག་ཆེན་པོའི་གཟུགས་མི་སྣང་བར་བྱས་ནས། ཚངས་པའི་ཆ་ལུགས་སུ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་སྟེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Māra , the evil one, then disappeared in his form of Maheśvara, and again reappeared in front of the Blessed One in the guise of Brahmā , saying:

source: །ཁྱོད་ཀྱི་ཤེས་རབ་ཀྱིས་ནི་ལས་དང་ཉོན་མོངས་སྲེད་པའི་མྱུ་གུ་རབ་ཏུ་བསལ།
en: “As you have crushed, by means of insight, action and afflictions, the sprouts of saṃsāra,

source: །དེ་ཡི་སླན་ཆད་ཐུབ་པ་ཇི་སླད་སེམས་ཅན་དོན་འདིར་འདི་ལྟར་སྡུག་བསྔལ་སྤྲོ།
en: Why, O Sage, do you still endure discomforts in this world for the sake of beings in this way?

source: །གཙོ་བོ་འགྲོ་བ་འདི་ན་ཁྱོད་ཀྱི་སྣོད་འགྱུར་སྐྱེ་བོ་གང་ནའང་མ་མཆིས་ཏེ།
en: Master, nowhere in this world is there a qualified recipient for what you offer.

source: །དུས་འདི་ལགས་ན་སྐྱོན་དང་བྲལ་ཁྱོད་ཅི་ཡི་སླད་དུ་མྱ་ངན་མྱུར་མི་འདའ།
en: Why do you not hurry to enter nirvāṇa, leaving all ailments behind? Now is the time!”

source: ངས་འདུལ་གང་འཁོད་སེམས་ཅན་མཚུངས་མེད་གང་གཱའི་བྱེ་མ་སྙེད།
en: “I can see peerless beings as numerous as the sand grains in the Gaṅgā

source: །ངས་མཐོང་དེ་དག་ང་ཡི་སྙིང་རྗེས་ཐར་བར་བྱ་བ་ཡིན།
en: Who require my guidance and will be liberated by me through compassion.

source: །འགྲོ་བ་རབ་འབྲིང་ངན་པར་གྱུར་པ་ཐར་ཏེ་མཐར་ཐུག་ན།
en: If people, be they of middling, superior, or the least capability, definitely need to be liberated,

source: །དེ་ནས་མྱ་ངན་འདའ་ཡིས་བློ་གྲོས་ངན་པ་གཡོས་ཅི་བསྐུལ།
en: Then why, O wicked one, do you give me the hypocritical advice that I should enter nirvāṇa?”

source: །དེ་ནས་ཡང་བདུད་སྡིག་ཅན་སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་ནས་ཡིད་ལ་གཅགས་ཏེ་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་ནས་རང་གི་གནས་སུ་སོང་སྟེ་མྱ་ངན་གྱི་ཁང་པར་ཞུགས་ནས་འདུག་པ་དང་། དེའི་མོད་ལ་བདུད་ཀྱི་གནས་ན་འཁོད་པའི་སེམས་ཅན་ཀུན་ཕན་ཚུན་འདི་སྐད་དུ་ཅིའི་རྒྱུས་བདག་ཅག་གི་རྒྱལ་པོ་ཆེན་པོ་འདི་མྱ་ངན་གྱི་ཁང་པར་ཞུགས་ཏེ་འདུག་པ་སུ་ཡང་མི་ཤེས་སོ་ཞེས་འདྲིའོ།
en: Māra , the evil one, again became unhappy, dejected, and sullen. He vanished on the spot and went back to his abode. He sat there, sinking into despondency. Immediately, all the beings who inhabited Māra ’s abode started asking one another, “What could be the reason that our great king just sits there, sinking into despondency? Nobody knows why.”

source: །དེ་ནས་བདུད་ཀྱི་བུ་མོ་ལྔ་བརྒྱ་ཙམ་རབ་ཏུ་དགའ་བར་བྱེད་པའི་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་ཐོགས་ཏེ་རབ་ཏུ་ཡིད་དུ་འོང་བའི་གོས་དང་། ལྷབ་ལྷུབ་དག་གིས་བདག་ཅག་བརྒྱན་ནས་རབ་ཏུ་ཡིད་དུ་འོང་ཞིང་མོས་པར་བྱེད་པའི་ལྷའི་སིལ་སྙན་བྱས་ཏེ།
en: Then the five hundred daughters of Māra , wearing clothes and adornments most pleasing to the mind, brought flower garlands and unguents capable of giving supreme pleasure.

source: རབ་ཏུ་ཡིད་དུ་འོང་བའི་དབྱངས་ཀྱིས་གླུ་ལེན་གར་བྱེད་ཅིང་།
en: They played celestial instruments with the most captivating sounds that totally thrill the mind, danced, and sang songs.

source: ཡན་ལག་ལྔ་དང་ལྡན་པའི་ལྷའི་སིལ་སྙན་དག་བྱས་ནས། དགའ་བའི་རྩེད་མོ་དང་ལྡན་པར་བདུད་སྡིག་ཅན་གྱི་མདུན་དུ་འཁོད་པ་དང་། བདུད་སྡིག་ཅན་དེས་ལག་པ་གཉིས་བསྒྲེང་ནས་བོས་དེ་སྒྲ་མ་བྱེད།
en: With sounds of a great celestial orchestra composed of five types of instruments that amuse and delight, they stood in front of the evil Māra . But he, the evil one, stretched forth his arms and cried out, “Stop this noise! Stop this noise!”

source: སྒྲ་མ་བྱེད་ཅེས་སྨྲས་པ་དང་། ཡུད་ཙམ་ཞིག་ལྷའི་བུ་མོ་དག་ཅང་མི་ཟེར་བར་འཁོད་དོ།
en: At these words, the celestial nymphs fell silent for a moment, but then broke into song again, striking and strumming their instruments.

source: །ཡང་གླུ་རབ་ཏུ་བླངས་ཤིང་སིལ་སྙན་བྱས་པ་དང་། བདུད་སྡིག་ཅན་གྱིས་ལག་པ་གཉིས་གཡབས་ཏེ་བོས་སོ།
en: At that, Māra , the evil one, once again threw up his arms and began to bellow.

source: །ལྷའི་བུ་མོ་དེ་དག་གིས་དགའ་བ་དང་ལྡན་པའི་གླུ་དང་། གར་དང་། སིལ་སྙན་ལན་བདུན་གྱི་བར་དུ་བྱས་པ་དང་། ཡང་དེ་བཞིན་དུ་བདུད་སྡིག་ཅན་དེ་ལག་པ་གཉིས་བསྒྲེང་ནས་འབོད་ཅིང་སྒྲ་མ་བྱེད། སྒྲ་མ་བྱེད་ཅེས་ཟེར་རོ།
en: Seven times the nymphs began to sing, dance, and play instruments, in ways bound to give pleasure, and seven times Māra, the evil one, threw his arms in the air and hollered, “Stop this noise!

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ལྷའི་བུ་མོ་དེ་དག་ཅང་མི་ཟེར་བར་འཁོད་དོ།
en: Stop this noise!” Thus commanded, the nymphs fell silent.

source: །དེ་ནས་ལྷའི་བུ་མོ་དབྱངས་སྙན་གློག་ཅེས་བྱ་བས་བདུད་སྡིག་ཅན་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: However, one nymph called Vidyudvalgusvarā bowed in the direction of the evil Māra and asked:

source: །གཙོ་བོ་ཁྱོད་ཀྱིས་དེང་འདིར་འཆི་འཕོའི་ལྟས་ཤིག་གཟིགས་སམ་ཅི།
en: “O Lord, have you just seen an omen portending your death?

source: །འོན་ཏམ་ཅི་ཞིག་དེ་རིང་འགྲོ་བ་ཞུགས་ཀྱིས་འཁྲུགས་གྱུར་ཏམ།
en: Or has the world become engulfed in fire today?

source: །འོན་ཏེ་འདི་ན་ཁྱོད་དགྲ་སྟོབས་ཆེན་འགའ་ཞིག་མཆིས་ལགས་སམ།
en: Or have you discovered an enemy stronger than you in this world?

source: །ཅི་ཡི་སླད་དུ་ཁྱེད་ནི་དགྱེས་པར་མི་བཞུགས་ཐུགས་ངན་མཛད།
en: Why are you so sad? Why won’t you have fun?”

source: །བདུད་ཀྱིས་སྨྲས་པ།
en: Māra replied:

source: ང་ལ་དགྲ་ཡོད་པ་ནི་སྟོབས་ལྡན་སེམས་ཐུལ་བ།
en: “I have a powerful enemy who has tamed his mind.

source: །ས་སྟེངས་ཤཱཀྱའི་བུ་ཕོ་སྒྱུ་མ་བསླབས་པའི་བློ།
en: On earth, the son of the Śākyas is trained to recognize magical tricks.

source: །དེ་ནི་ཅི་ནས་གལ་ཏེ་བརླག་པར་མ་གྱུར་ན།
en: If he is not brought to ruin, then, one way or another,

source: །དེ་ཡིས་ང་ཡི་འདོད་ཁམས་འདི་ནི་སྟོངས་པར་བྱེད།
en: He will empty my realm of desires.”

source: །ལྷའི་བུ་མོས་སྨྲས་པ། གཙོ་བོ་སྲིད་གསུམ་བཅིངས་སྲེད་རྒྱ་མཚོ་མཐའ་རིངས་ལ། །ཟད་བགྱིད་ནུས་པའི་སྟོབས་དང་ལྡན་པ་སུ་ཞིག་མཆིས།
en: The nymphs inquired:

source: །བདག་པོ་ཐབས་སྟོབས་བརྩོན་འགྲུས་རྩལ་རྣམས་གང་གིས་ཀྱང་།
en: “Lord, by what means, power, valor, and courage

source: །དེ་ལ་དེ་རིང་མ་ལུས་བགྱིད་པར་ནུས་མ་མཆིས།
en: Can he be brought to final and complete ruin, here on this day? Who could possess the power to dry up the ocean of craving With its vast waters, the fetters of threefold existence?”

source: སྦྱིན་དང་བརྟུལ་ཞུགས་བསམ་པ་སྨོན་ལམ་སྙིང་རྗེའི་ཞགས་པ་ཅན།
en: “His lassos are generosity, yogic discipline, intention, compassion, and aspiration.

source: །སྟོང་པ་མཚན་མ་མེད་པའི་མཚོན་ཆ་མཆོག་དང་གཞུ་ཐོགས་ཏེ།
en: His bow is armed with a supreme arrow aimed at the target of emptiness. He gives instructions on how to totally extinguish conditioned existence,

source: །འཁོར་བ་ལས་བྱུང་རབ་ཏུ་ཞི་བའི་ལམ་དང་འཐུན་གྱུར་ནས། །སྲིད་པ་མ་ལུས་བཟློག་པ་ཉེ་བར་བསྟན་པར་བྱེད་པ་པོ།
en: Being predisposed to pacifying the pathways emerging from within saṃsāra. “His pupils dwell in empty towns and villages, Deep in the forest, or in the mountain wilderness.

source: །དེ་ཡི་སློབ་མ་བསམ་གཏན་ལ་ནི་མངོན་པར་བརྩོན་ཡིད་ཀྱིས།
en: With minds diligently engaged in meditation, they live in solitude

source: །དབེན་པར་རྒྱུ་ཞིང་ཉེས་པ་ཟད་པར་བྱ་ཕྱིར་ཁོར་ཟུག་ཏུ།
en: And continually strive to eliminate their faults.

source: །ཆོ་ག་བཞིན་དུ་ཞུགས་ནས་གྲོང་དང་གྲོང་ཁྱེར་སྟོང་པ་དང་། །ནགས་ཀྱི་ནང་དག་དང་ནི་རི་ཡི་སྨན་ལྗོངས་རྣམས་ན་གནས།
en: “Two of them, Upatiṣya and Kaulita, trained by the Sage,

source: །རྫུ་འཕྲུལ་དང་ནི་སྟོབས་དང་སྙིང་རྗེའི་གྲོགས་དང་ལྡན་པ་ཡི། །དམ་པ་ཉེ་རྒྱལ་པང་ནས་སྐྱེས་གཉིས་ཐུབ་པས་བཏུལ་བར་འགྱུར།
en: Have for companions their own miraculous abilities, powers, and compassion.

source: །རབ་དུལ་ཆོས་ཅན་འཇིག་རྟེན་གསུམ་ཀུན་ཆོ་ག་བཞིན་དུ་བཏུལ།
en: His Dharma, skillfully presented in ways suited to everybody in the threefold universe,

source: །དེས་ནི་ང་ཡི་འདོད་ཁམས་འདི་དག་སྟོངས་པར་བྱེད་པར་འགྱུར།
en: Will certainly empty my desire realm.”

source: །དེ་ནས་བདུད་ཀྱི་བུ་མོ་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་བདུད་སྡིག་ཅན་ལས་བཅོམ་ལྡན་འདས་ཀྱི་ཡོན་ཏན་གྱི་བསྔགས་པ་ཐོས་ནས་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རྣམ་པ་དང་བྲལ་བའི་གློག་ཅེས་བྱ་བ་ཐོབ་བོ། །དེ་ནས་བདུད་ཀྱི་བུ་མོ་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་ལྷའི་སིལ་སྙན་དང་། ལྷའི་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ལྷབ་ལྷུབ་དང་། སྤུད་པ་དང་། རྒྱན་དེ་དག་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་གཏོར་བ་དང་། ལྷའི་མེ་ཏོག་དང་། སིལ་སྙན་ནས་རྒྱན་གྱི་བར་དུ་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་རྫུ་འཕྲུལ་གྱི་མཐུས་འོད་མའི་ཚལ་དུ་བབ་པར་གྱུར་ཏོ།
en: Having heard this description of the Blessed One’s virtues from the evil Māra, all of his five hundred daughters attained the bodhisattva absorption formless bolt of lightning. To offer worship to the Blessed One, they cast in his direction items such as celestial instruments, flowers, perfume, garlands, fragrant oils, adornments, and jewelry.

source: །བདུད་ཀྱི་བུ་མོ་དེ་དག་ཀྱང་གཡོག་དང་བཅས་པས་སོ་སོ་ནས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་།
en: They cast them in the direction of the Blessed One, by whose magical power these instruments and so forth rained down onto Veṇuvana, and the daughters themselves, along with their retinues, could see it raining.

source: །དེ་དག་གིས་མཐོང་ནས་ཀྱང་རབ་ཏུ་དགའ་བ་དང་རངས་པ་སྐྱེས་པར་གྱུར་ཏོ།
en: Seeing that such rain was falling upon Veṇuvana, they were delighted and delighted even more.

source: །གང་གི་ཕྱིར་འོད་མའི་ཚལ་དུ་འདི་ལྟ་བུའི་མེ་ཏོག་གི་ཆར་རབ་ཏུ་བབ་ཅེས་དགེ་སློང་དེ་དག་ཐེ་ཚོམ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཅོམ་ལྡན་འདས་ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་གཡོག་དང་བཅས་པ་འདི་གཉིས་ལ་ངོ་མཚར་དང་རྨད་དུ་བྱུང་བ་ཆེན་པོ་སྔོན་མ་མཐོང་མ་ཐོས་པའི་མེ་ཏོག་གི་ཆར་ཆེན་པོ་རབ་ཏུ་བབ་པ་ལགས་སམ།
en: The monks, however, became suspicious and asked the Blessed One, “How is it, O Blessed One, that such a marvelous and extraordinary rain, never seen or heard before, is showering upon Śāriputra and Maudgalyāyana along with their retinues?

source: བཅོམ་ལྡན་འདས་འདིའི་རྒྱུ་ཅི་ལགས།
en: What could be the cause of it?

source: རྐྱེན་གང་ལགས།
en: What is the occasion?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་འདི་གཉིས་ཀྱི་མཐུ་མ་ཡིན་ཏེ།
en: The Blessed One replied, “It is not by the will of these two noble sons that this great rain of flowers and so forth is falling.

source: བདུད་སྡིག་ཅན་གྱི་གཡོག་མོ་ལྔ་བརྒྱ་ཙམ་གྱིས་བདུད་ཀྱི་ཁང་པ་དེ་ནས་ང་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་འདི་ལྟ་བུའི་མེ་ཏོག་གི་ཆར་ཆེན་པོ་ནས་རྒྱན་གྱི་བར་གྱི་ཆར་ཕབ་བོ།
en: Rather, it was released from the abode of the evil Māra by his five hundred daughters along with their retinues, in order to worship me.

source: །དེ་དག་རིང་པོ་མི་ཐོགས་པར་འདིར་འོངས་ཏེ། ང་ལས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་འཐོབ་བོ།
en: Soon they will come here and receive from me the prophecy regarding their attainment of the unsurpassed and perfect awakening.”

source: །དེ་ནས་བདུད་ཀྱི་བུ་མོ་ལྔ་བརྒྱ་ཙམ་པོ་དེ་དག་སོ་སོ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་གསུང་དང་བརྗོད་པའི་དབྱངས་ཐོས་ནས། བཅོམ་ལྡན་འདས་ལ་དེ་བས་ཀྱང་རབ་ཏུ་དགའ་བ་སྐྱེས་ཏེ། དེ་དག་དགའ་བ་དང་རངས་པ་དེས་བྱང་ཆུབ་ཀྱི་སེམས་བརྗེད་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་བོ།
en: The five hundred daughters of Māra , the evil one, heard the Blessed One’s discourse from his own mouth and were overjoyed. Through faith and intense joy, which they developed in his presence, they attained the absorption not losing the mind of awakening

source: །དེ་ནས་ཡང་བདུད་ཀྱི་བུ་མོ་དེ་དག་བདུད་ཀྱི་ཁང་པ་དེར་གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ཏེ། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ཕྱོགས་གང་ན་བཞུགས་པའི་ཕྱོགས་དེར་བལྟས་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Subsequently, right there in Māra ’s abode, they each donned a robe of a single piece of material, and they placed their right knees on the ground, folded their hands, and, looking in the direction where the Blessed One was seated, said: “The river of craving of the entire world has completely dried up.

source: །སྲེད་ཆུ་མ་ལུས་སྐེམས་པའི་འགྲོ་བའི་མིག་གཅིག་པུ། །མིག་མ་མཆིས་པའི་འཇིག་རྟེན་ཀུན་ལ་གཟིགས་ནས་ནི།
en: As the single eye, seeing the world that has defective eyes,

source: །ཁྱོད་དེང་ལྷ་དང་མིར་བཅས་པ་ཡི་འགྲོ་བ་སྒྲོལ།
en: You are presently the savior of the world with its humans and gods.

source: །ཐུབ་པ་བདག་ཅག་ཇི་ལྟར་མྱུར་དུ་སངས་རྒྱས་འགྱུར།
en: How, O sage, can we swiftly become buddhas in this world?

source: །ལྷ་དང་མིས་མཆོད་དོན་དམ་གསུང་བ་བཅོམ་ལྡན་འདས།
en: “You are worshiped by gods and humans, O Blessed One, as you proclaim the absolute truth.

source: །བདག་ཅག་འཐུན་པར་བུད་མེད་སྨད་པ་ཉིད་སྤངས་ནས།
en: Through your magical power, may each of us leave behind vile womanhood

source: །བློ་མཆོག་ཁྱོད་ཀྱི་འཕྲུལ་གྱི་དྲུང་དུ་མྱུར་བར་ནི།
en: And swiftly come into your presence, O high-minded one!

source: །མཆིས་ནས་འདི་བཞིན་ཐུབ་པའི་དབང་པོའི་གསུང་མཉན་ཏོ།
en: Then, we shall listen to the teachings of the lord of sages.

source: །བདག་མེད་གསུང་བ་དོན་དམ་གཟིགས་པ་བཅོམ་ལྡན་འདས།
en: “You, O Blessed One, are a proponent of no-self who beholds the absolute truth.

source: །བྱང་ཆུབ་ཡན་ལག་རིན་ཆེན་དྲི་མེད་ནོར་གསུང་སྒྲོན།
en: You are a lamp of immaculate speech who upholds the jewel of the limbs of awakening.

source: །མཚུངས་མེད་བདུད་ཀྱི་སྟོབས་བཏུལ་ཁྱོད་ཀྱིས་བདག་ཅག་ལ།
en: Having defeated the forces of Māra , you are without equal.

source: །ད་ལྟར་མྱུར་དུ་ལྷན་ཅིག་བྱང་ཆུབ་ལུང་བསྟན་གསོལ།
en: Please prophesy now our swift and collective attainment of buddhahood.”

source: །དེ་ནས་བདུད་ཀྱི་བུ་མོ་དེ་དག་སྟན་ལས་ལངས་ནས་མགྲིན་གཅིག་ཏུ་བདུད་སྡིག་ཅན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The daughters then rose from their seats and, in one voice, said this to Māra , the evil one:

source: །ཉེས་བྱས་བློ་གྲོས་ཅན་ཁྱོད་སྙིང་པོ་མེད་གཡོ་བའི།
en: “How could you, O ill-willed one, be so wicked minded in the presence of the Blessed One,

source: །དཔལ་རྙེད་ཅི་ཕྱིར་བཅོམ་ལྡན་འདས་ལ་སྡང་བར་སེམས།
en: Having yourself attained only a fickle and worthless glory?

source: །དྲེགས་པས་གོས་ནས་སྐྱེ་བ་ལ་སོགས་སྡུག་བསྔལ་གྱིས།
en: Every living body is attended upon by the suffering of birth and so forth.

source: །ལུས་ཀུན་གཙེས་ཏེ་མི་བཟད་གནས་སུ་ཉེ་བར་སོང་།
en: Tainted by pride, you will fall into a terrible state of existence.

source: །དེ་ལྟར་ཁྲོ་བ་སྤངས་ཏེ་རྒྱལ་ལ་དད་པར་གྱིས།
en: “Therefore, have faith in the Victorious One, abandon your anger,

source: །འཁོར་བའི་ཉེས་པ་དྲེགས་པའི་འདམ་ལས་ཐར་བའི་བདག །འདི་ནི་ཉིད་ཀྱིས་འགྲོ་བ་ཀུན་གྱི་ངོ་བོ་མཁྱེན།
en: And pull yourself out of the mire of pride, the fault of saṃsāra. He knows the nature of all beings.

source: །ཐུགས་རྗེ་ཅན་གྱི་སྐྱབས་སུ་འདོང་གིས་མྱུར་དུ་བཞུད།
en: Come, let us promptly go to the compassionate one and follow his way.”

source: །དེ་ནས་བདུད་སྡིག་ཅན་ཤིན་ཏུ་གདུག་པའི་ཡིད་དང་ལྡན་པ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: But the evil Māra , his mind absolutely corrupted, thought this:

source: བདག་གིས་འདི་འདྲ་བའི་བདུད་ཀྱི་སྟོབས་ཀྱི་ཡུལ་དྲག་པོ་དྲན་པར་བྱས་ལ། གང་གཡོག་མོ་ལྔ་བརྒྱ་ཙམ་པོ་འདི་དག་བདག་ཉིད་བཅིང་བ་ལྔས་བཅིངས་པར་མཐོང་བར་བྱས་ཏེ།
en: “I must now think of such force, within the power of Māra , that these five hundred along with their retinues will each be snared and bound with five fetters and turned back at this very point, not being able to proceed any further.”

source: འདི་ནས་བཟློག་ལ་འགྲོ་མི་ནུས་པར་བྱའོ་སྙམ་པ་དང་། བདུད་དེས་དེ་དག་བཅིངས་པར་མ་ནུས་སོ།
en: However, Māra was unable to bind them.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why was that?

source: འདི་ལྟར་གཡོག་མོ་ལྔ་བརྒྱ་ཙམ་པོ་དེ་དག་དེ་བཞིན་གཤེགས་པས་བྱིན་གྱིས་བརླབས་པའི་ཕྱིར་རོ།
en: Because these five hundred with their retinues had been blessed by the Thus-Gone One.

source: །དེ་ནས་གཡོག་མོ་ལྔ་བརྒྱ་ཙམ་དེ་དག་བདུད་སྡིག་ཅན་གྱི་དྲུང་ནས་དོང་བ་དང་། དེ་ནས་བདུད་སྡིག་ཅན་རབ་ཏུ་ཁྲོས་ཏེ་དེ་འདི་སྙམ་དུ་སེམས་སོ། །བདག་གིས་ཡང་འདི་འདྲ་བའི་བདུད་ཀྱི་སྟོབས་ཀྱི་ཡུལ་དྲག་པོ་དྲན་པར་བྱས་ཏེ། ཅི་ནས་བདག་གིས་གཡོག་མོ་དེ་དག་ཕྱོགས་དང་ཕྱོགས་མཚམས་ཐམས་ཅད་འཁྲུལ་ནས་དགེ་སྦྱོང་གཽ་ཏ་མ་མི་མཐོང་ཞིང་སླར་ཡང་བདག་གི་གནས་སུ་འོང་བར་ནམ་མཁའ་འདི་དག་ཐམས་ཅད་དུ་རྣམ་པར་འཐོར་རླུང་དང་། རླུང་ནག་པོ་ཆེན་པོས་ཀུན་ཏུ་ཁྱབ་པར་བྱའོ་སྙམ་ན་ཡང་སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་བརླབས་ཀྱི་སྟོབས་ཀྱིས་རླུང་ཅུང་ཟད་ཀྱང་ལངས་པར་བྱེད་མ་ནུས་སོ།
en: He was unable to stop them, and the five hundred, along with their retinues, went before Māra, the evil one, who became even more enraged. He thought, “I must now think of such force, within the power of Māra, that this entire area becomes covered in thick black clouds and pummeled by violent gusts of wind, so that they get lost wandering in all directions with their retinues and, unable to see the monk Gautama, will return to my abode.”

source: །ཐ་ན་སྐྲའི་རྩེ་མོ་གཅིག་ཙམ་ཡང་བསྐྱོད་མ་ནུས་ན་མང་དུ་ལྟ་ཅི་སྨོས།
en: However, because of the power of the Buddha’s blessing, he was unable to raise sufficient wind to stir even a single hair tip, not to mention anything more.
